# 주요 함수

In [2]:
import pandas as pd
import numpy as np

## concat  통합하기 

    이어붙이기를 하기

### 이 함수는 기본적으로 join은 outer를 기준으로 처리한다.

    병합하는 이유는 objs는 리스트로 여러 개를 넣어서 처리할 수 있다.

In [4]:
help(pd.concat)

Help on function concat in module pandas.core.reshape.concat:

concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, copy=True)
    Concatenate pandas objects along a particular axis with optional set logic
    along the other axes.

    Can also add a layer of hierarchical indexing on the concatenation axis,
    which may be useful if the labels are the same (or overlapping) on
    the passed axis number.

    Parameters
    ----------
    objs : a sequence or mapping of Series, DataFrame, or Panel objects
        If a dict is passed, the sorted keys will be used as the `keys`
        argument, unless it is passed, in which case the values will be
        selected (see below). Any None objects will be dropped silently unless
        they are all None in which case a ValueError will be raised
    axis : {0/'index', 1/'columns'}, default 0
        The axis to concatenate along
    join : {'inner', 'outer'}, default 'outer'
        How to handle indexes on other axis(es)
    join_axes : list of Index objects
        Specific indexes to use for the other n - 1 axes instead of performing
        inner/outer set logic
    ignore_index : boolean, default False
        If True, do not use the index values along the concatenation axis. The
        resulting axis will be labeled 0, ..., n - 1. This is useful if you are
        concatenating objects where the concatenation axis does not have
        meaningful indexing information. Note the index values on the other
        axes are still respected in the join.
    keys : sequence, default None
        If multiple levels passed, should contain tuples. Construct
        hierarchical index using the passed keys as the outermost level
    levels : list of sequences, default None
        Specific levels (unique values) to use for constructing a
        MultiIndex. Otherwise they will be inferred from the keys
    names : list, default None
        Names for the levels in the resulting hierarchical index
    verify_integrity : boolean, default False
        Check whether the new concatenated axis contains duplicates. This can
        be very expensive relative to the actual data concatenation
    copy : boolean, default True
        If False, do not copy data unnecessarily

    Returns
    -------
    concatenated : type of objects

    Notes
    -----
    The keys, levels, and names arguments are all optional.

    A walkthrough of how this method fits in with other tools for combining
    panda objects can be found `here
    <http://pandas.pydata.org/pandas-docs/stable/merging.html>`__.

    See Also
    --------
    Series.append
    DataFrame.append
    DataFrame.join
    DataFrame.merge

    Examples
    --------
    Combine two ``Series``.

    >>> s1 = pd.Series(['a', 'b'])
    >>> s2 = pd.Series(['c', 'd'])
    >>> pd.concat([s1, s2])
    0    a
    1    b
    0    c
    1    d
    dtype: object

    Clear the existing index and reset it in the result
    by setting the ``ignore_index`` option to ``True``.

    >>> pd.concat([s1, s2], ignore_index=True)
    0    a
    1    b
    2    c
    3    d
    dtype: object

    Add a hierarchical index at the outermost level of
    the data with the ``keys`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2',])
    s1  0    a
        1    b
    s2  0    c
        1    d
    dtype: object

    Label the index keys you create with the ``names`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2'],
    ...           names=['Series name', 'Row ID'])
    Series name  Row ID
    s1           0         a
                 1         b
    s2           0         c
                 1         d
    dtype: object

    Combine two ``DataFrame`` objects with identical columns.

    >>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
    ...                    columns=['letter', 'number'])
    >>> df1
      letter  number
    0      a       1
    1      b       2
    >>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
    ...                    columns=['letter', 'number'])
    >>> df2
      letter  number
    0      c       3
    1      d       4
    >>> pd.concat([df1, df2])
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects with overlapping columns
    and return everything. Columns outside the intersection will
    be filled with ``NaN`` values.

    >>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
    ...                    columns=['letter', 'number', 'animal'])
    >>> df3
      letter  number animal
    0      c       3    cat
    1      d       4    dog
    >>> pd.concat([df1, df3])
      animal letter  number
    0    NaN      a       1
    1    NaN      b       2
    0    cat      c       3
    1    dog      d       4

    Combine ``DataFrame`` objects with overlapping columns
    and return only those that are shared by passing ``inner`` to
    the ``join`` keyword argument.

    >>> pd.concat([df1, df3], join="inner")
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects horizontally along the x axis by
    passing in ``axis=1``.

    >>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
    ...                    columns=['animal', 'name'])
    >>> pd.concat([df1, df4], axis=1)
      letter  number  animal    name
    0      a       1    bird   polly
    1      b       2  monkey  george

    Prevent the result from including duplicate index values with the
    ``verify_integrity`` option.

    >>> df5 = pd.DataFrame([1], index=['a'])
    >>> df5
       0
    a  1
    >>> df6 = pd.DataFrame([2], index=['a'])
    >>> df6
       0
    a  2
    >>> pd.concat([df5, df6], verify_integrity=True)
    ValueError: Indexes have overlapping values: ['a']

In [19]:
s1 = pd.Series([0,1],index=['a','b'])

## Series를 가지고 concat을 처리

In [21]:
s1

a    0
b    1
dtype: int64

In [20]:
s2 = pd.Series([2,3,4], index=['c','b','a'])

In [22]:
s2

c    2
b    3
a    4
dtype: int64

In [23]:
s3 = pd.Series([5,6],index=['f','g'])

In [24]:
s3

f    5
g    6
dtype: int64

### 세로로 병합하기

In [25]:
pd.concat([s1,s2])

a    0
b    1
c    2
b    3
a    4
dtype: int64

In [26]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
b    3
a    4
f    5
g    6
dtype: int64

### 키를 추가해서 넣기

In [38]:
pd.concat([s1, s2], keys=['s1', 's2',])

s1  a    0
    b    1
s2  c    2
    b    3
    a    4
dtype: int64

### 가로로 병합하기

In [27]:
pd.concat([s1,s2],axis=1)

     0  1
a  0.0  4
b  1.0  3
c  NaN  2

In [36]:
pd.concat([s1,s2],axis=1,join='inner')

   0  1
a  0  4
b  1  3

In [28]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  4.0  NaN
b  1.0  3.0  NaN
c  NaN  2.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [37]:
pd.concat([s1,s2,s3], axis=1, join='inner')

Empty DataFrame
Columns: [0, 1, 2]
Index: []

## 데이터프레임으로 병합

In [3]:
df = pd.DataFrame(np.arange(16).reshape(4,4), columns=['a','b','c','d'])
print(df)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### 일한 데이터프레임을 결할 때 기본은 세로로 병합되어 처리 됨

In [5]:
df_c = pd.concat([df,df])

In [6]:
df_c

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### 가로로 병합을 하려면 축을 인자로 넣어야 한다.

In [7]:
pd.concat([df,df],axis=1)

    a   b   c   d   a   b   c   d
0   0   1   2   3   0   1   2   3
1   4   5   6   7   4   5   6   7
2   8   9  10  11   8   9  10  11
3  12  13  14  15  12  13  14  15

###  열이 다른 경우에는 횡으로 붙이면 원소가 불일지 되는 곳에는 NaN으로 처리

In [30]:
df1 = pd.DataFrame(np.arange(16,32).reshape(4,4), index=[11,12,13,14],columns=['a','b','c','d'])
print(df1)

     a   b   c   d
11  16  17  18  19
12  20  21  22  23
13  24  25  26  27
14  28  29  30  31

In [31]:
pd.concat([df,df1],axis=0)

     a   b   c   d
0    0   1   2   3
1    4   5   6   7
2    8   9  10  11
3   12  13  14  15
11  16  17  18  19
12  20  21  22  23
13  24  25  26  27
14  28  29  30  31

## 조인을 이용해서 처리하기

### 결합할 때 교집합을 처리

In [32]:
pd.concat([df,df1],join='inner')

     a   b   c   d
0    0   1   2   3
1    4   5   6   7
2    8   9  10  11
3   12  13  14  15
11  16  17  18  19
12  20  21  22  23
13  24  25  26  27
14  28  29  30  31

### 병합할 때 조인에 대한 기준 축인 칼럼을 부여할 수 있다.

In [33]:
df1.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [34]:
pd.concat([df,df1],join_axes=[df1.columns])

     a   b   c   d
0    0   1   2   3
1    4   5   6   7
2    8   9  10  11
3   12  13  14  15
11  16  17  18  19
12  20  21  22  23
13  24  25  26  27
14  28  29  30  31

### 붙이기 할 때 세부적인 같이 없을 경우는 nan 처리

In [35]:
pd.concat([df,df1],axis=1)

       a     b     c     d     a     b     c     d
0    0.0   1.0   2.0   3.0   NaN   NaN   NaN   NaN
1    4.0   5.0   6.0   7.0   NaN   NaN   NaN   NaN
2    8.0   9.0  10.0  11.0   NaN   NaN   NaN   NaN
3   12.0  13.0  14.0  15.0   NaN   NaN   NaN   NaN
11   NaN   NaN   NaN   NaN  16.0  17.0  18.0  19.0
12   NaN   NaN   NaN   NaN  20.0  21.0  22.0  23.0
13   NaN   NaN   NaN   NaN  24.0  25.0  26.0  27.0
14   NaN   NaN   NaN   NaN  28.0  29.0  30.0  31.0

In [13]:
pd.concat([df,df1],axis=1,join='outer')

       a     b     c     d     a     b     c     d
0    0.0   1.0   2.0   3.0   NaN   NaN   NaN   NaN
1    4.0   5.0   6.0   7.0   NaN   NaN   NaN   NaN
2    8.0   9.0  10.0  11.0   NaN   NaN   NaN   NaN
3   12.0  13.0  14.0  15.0   NaN   NaN   NaN   NaN
11   NaN   NaN   NaN   NaN  16.0  17.0  18.0  19.0
12   NaN   NaN   NaN   NaN  20.0  21.0  22.0  23.0
13   NaN   NaN   NaN   NaN  24.0  25.0  26.0  27.0
14   NaN   NaN   NaN   NaN  28.0  29.0  30.0  31.0

## 3개의 데이터프레임을 병합하기

In [14]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])


df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])


df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [15]:
frames = [df1, df2, df3]

result = pd.concat(frames)

In [16]:
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### append로 붙이기는 새로윤 데이터 프레임 객체를 만든다.

In [17]:
df4 = df2.append(df3)

In [18]:
df4

      A    B    C    D
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11